__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to
==================================================================================================
 input_1 (InputLayer)           [(None, 1)]          0           []

 input_2 (InputLayer)           [(None, 1)]          0           []

 embedding (Embedding)          (None, 1, 100)       6427700     ['input_1[0][0]']

 embedding_1 (Embedding)        (None, 1, 100)       6427700     ['input_2[0][0]']

 dot (Dot)                      (None, 1, 1)         0           ['embedding[0][0]',
                                                                  'embedding_1[0][0]']

 reshape (Reshape)              (None, 1)            0           ['dot[0][0]']
=======
Total params: 12,855,400
Trainable params: 12,855,400
Non-trainable params: 0